state-machine.dot
digraph G {
  graph [size=10 label="Invoice state machine"]
  edge [dir=forward]

  node [shape = circle, label = created]; SCR;
  node [shape = doublecircle, label = revoked]; SRV;
  node [shape = doublecircle, label = rejected]; SRJ;
  node [shape = doublecircle, label = expired]; SEP;
  node [shape = circle, label = pending]; SPN;
  node [shape = circle, label = approved]; SAP;
  node [shape = doublecircle, label = deleted]; SDL;

  SCR  ->  SPN [ label = "T1" ];
  SCR  ->  SRJ [ label = "T2" ];
  SCR  ->  SRV [ label = "T3" ];

  SPN  ->  SEP [ label = "T4" ];
  SPN  ->  SDL [ label = "T5" ];
  SPN  ->  SAP [ label = "T6" ];
  SPN  ->  SRV [ label = "T7" ];

  SAP  ->  SAP [ label = "T8" ];
  SAP  ->  SPN [ label = "T9" ];
  SAP  ->  SDL [ label = "T10" ];
}
